nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/demo_apps/bubble_peripheral/peripherals.c
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Peripherals v12.0
processor: MC56F80748
package_id: MC56F80748VLH
mcu_data: ksdk2_0
processor_version: 0.13.4
board: MC56F80000-EVK
functionalGroups:
- name: BOARD_InitPeripherals
  UUID: 86257b75-723c-4947-ab03-c6d88072c440
  called_from_default_init: true
  selectedCore: core0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/

/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
component:
- type: 'system'
- type_id: 'system_54b53072540eeeb8f8e9343e71f28176'
- global_system_definitions:
  - user_definitions: ''
  - user_includes: ''
  - init_delay_enable: 'false'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/

/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
component:
- type: 'uart_cmsis_common'
- type_id: 'uart_cmsis_common_9cb8e302497aa696fdbb5a4fd622c2a8'
- global_USART_CMSIS_common:
  - quick_selection: 'default'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/

/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
component:
- type: 'gpio_adapter_common'
- type_id: 'gpio_adapter_common_57579b9ac814fe26bf95df0a384c36b6'
- global_gpio_adapter_common:
  - quick_selection: 'default'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

/***********************************************************************************************************************
 * Included files
 **********************************************************************************************************************/
#include "peripherals.h"

/***********************************************************************************************************************
 * BOARD_InitPeripherals functional group
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * INTC initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'INTC'
- type: 'intc_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'intc_reg_5d361a53fef6bec91d1f7c2aeedd895b'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'INTC'
- config_sets:
  - intc:
    - dsc_core_int_level: 'mask_level_0_1_2'
    - interrupt_table:
      - 0: []
    - interrupts: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

/* Empty initialization function (commented out)
static void INTC_init(void) {
} */

/***********************************************************************************************************************
 * Flash_configuration initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'Flash_configuration'
- type: 'dsc_flash_config'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'dsc_flash_config_87b8cda2db02ccd1732cf954ffb02af3'
- functional_group: 'BOARD_InitPeripherals'
- config_sets:
  - fcf_config:
    - flashConfig:
      - keyBytes:
        - 0:
          - byteValue: '0xFF'
        - 1:
          - byteValue: '0xFF'
        - 2:
          - byteValue: '0xFF'
        - 3:
          - byteValue: '0xFF'
        - 4:
          - byteValue: '0xFF'
        - 5:
          - byteValue: '0xFF'
        - 6:
          - byteValue: '0xFF'
        - 7:
          - byteValue: '0xFF'
      - protBytes:
        - 0:
          - byteValue: '0xFF'
        - 1:
          - byteValue: '0xFF'
        - 2:
          - byteValue: '0xFF'
        - 3:
          - byteValue: '0xFF'
      - FSEC:
        - SEC: 'unsecure'
        - FSLACC: 'granted'
        - KEYEN: 'false'
        - MEEN: 'true'
      - pwrMode: '1'
    - fcf_codegenerator: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

/* Empty initialization function (commented out)
static void Flash_configuration_init(void) {
} */

/***********************************************************************************************************************
 * LPI2C0 initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'LPI2C0'
- type: 'lpi2c_reg'
- mode: 'General'
- custom_name_enabled: 'false'
- type_id: 'lpi2c_reg_36f149a0ba382218b02b0c28d7fc9207'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'LPI2C0'
- config_sets:
  - generalConfigSet:
    - lpi2c_template_params: []
    - clkConfig_t:
      - clockSource: 'Lpi2cClock'
      - clockSourceFreq: 'ClocksTool_DefaultInit'
    - masterSlaveStruct:
      - masterInitStruct:
        - masterInit: 'true'
        - masterStruct:
          - MCR_MEN: 'true'
          - masterClocks:
            - MCFGR1_PRESCALE: '1'
            - MCFGR3_FILTSDA: '0'
            - MCFGR3_FILTSCL: '0'
            - masterStandardFastModes:
              - MCCR0_CLKLO: '60'
              - MCCR0_CLKHI: '62'
              - MCCR1_DATAVD: '30'
              - MCCR1_SETHOLD: '30'
            - masterHighModes:
              - MCCR2_CLKLO: '25'
              - MCCR2_CLKHI: '22'
              - MCCR3_DATAVD: '10'
              - MCCR3_SETHOLD: '10'
          - MCFGR1_FRCHS: 'false'
          - MCR_DBGEN: 'false'
          - MCR_DOZEN: 'false'
          - MCFGR1_PINCFG: '0'
          - MCFGR1_TIMECFG: '0'
          - MCFGR1_IGNACK: 'false'
          - MCFGR1_AUTOSTOP: 'false'
          - MCFGR2_BUSIDLE: '0'
          - MCFGR4_PINLOW: '0'
          - masterDataMatch:
            - MCFGR1_MATCFG: '0'
            - MDMR_MATCH0: '0'
            - MDMR_MATCH1: '0'
            - MCFGR0_RDMO: 'false'
          - masterHostRequest:
            - MCFGR0_HREN: 'false'
            - MCFGR0_HRSEL: '0'
            - MCFGR0_HRPOL: '0'
          - masterFIFO:
            - MCR_RRF: 'true'
            - MCR_RTF: 'true'
            - MCFGR0_CIRFIFO: 'false'
            - MFCR_RXWATER: '0'
            - MFCR_TXWATER: '0'
          - masterDMA: ''
          - masterInterrupts: ''
      - slaveInitStruct:
        - slaveInit: 'false'
    - enable_irq: 'false'
    - interrupt:
      - IRQn: 'kLPI2C0_VECTORn'
      - dsc_enable_interrrupt: 'iprVal0'
      - enable_custom_name: 'false'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void LPI2C0_init(void) {
/****************************************************************************/
/* LPI2C initialization */
/****************************************************************************/
  /* Software reset LPI2C0. */
  SIM->PSWR1 |= SIM_PSWR1_LPI2C0_MASK;
  SIM->PSWR1 &= ~ SIM_PSWR1_LPI2C0_MASK;
#if defined(LPI2C0_MIER_INIT)
  LPI2C0->MIER = LPI2C0_MIER_INIT;
#endif /* LPI2C0_MIER_INIT */
#if defined(LPI2C0_MDER_INIT)
  LPI2C0->MDER = LPI2C0_MDER_INIT;
#endif /* LPI2C0_MDER_INIT */
#if defined(LPI2C0_MCFGR0_INIT)
  LPI2C0->MCFGR0 = LPI2C0_MCFGR0_INIT;
#endif /* LPI2C0_MCFGR0_INIT */
#if defined(LPI2C0_MCFGR1_INIT)
  LPI2C0->MCFGR1 = LPI2C0_MCFGR1_INIT;
#endif /* LPI2C0_MCFGR1_INIT */
#if defined(LPI2C0_MCFGR2_INIT)
  LPI2C0->MCFGR2 = LPI2C0_MCFGR2_INIT;
#endif /* LPI2C0_MCFGR2_INIT */
#if defined(LPI2C0_MCFGR3_INIT)
  LPI2C0->MCFGR3 = LPI2C0_MCFGR3_INIT;
#endif /* LPI2C0_MCFGR3_INIT */
#if defined(LPI2C0_MCFGR4_INIT)
  LPI2C0->MCFGR4 = LPI2C0_MCFGR4_INIT;
#endif /* LPI2C0_MCFGR4_INIT */
#if defined(LPI2C0_MDMR_INIT)
  LPI2C0->MDMR = LPI2C0_MDMR_INIT;
#endif /* LPI2C0_MDMR_INIT */
#if defined(LPI2C0_MCCR0_INIT)
  LPI2C0->MCCR0 = LPI2C0_MCCR0_INIT;
#endif /* LPI2C0_MCCR0_INIT */
#if defined(LPI2C0_MCCR1_INIT)
  LPI2C0->MCCR1 = LPI2C0_MCCR1_INIT;
#endif /* LPI2C0_MCCR1_INIT */
#if defined(LPI2C0_MCCR2_INIT)
  LPI2C0->MCCR2 = LPI2C0_MCCR2_INIT;
#endif /* LPI2C0_MCCR2_INIT */
#if defined(LPI2C0_MCCR3_INIT)
  LPI2C0->MCCR3 = LPI2C0_MCCR3_INIT;
#endif /* LPI2C0_MCCR3_INIT */
#if defined(LPI2C0_MFCR_INIT)
  LPI2C0->MFCR = LPI2C0_MFCR_INIT;
#endif /* LPI2C0_MFCR_INIT */
#if defined(LPI2C0_MCR_INIT)
  LPI2C0->MCR = LPI2C0_MCR_INIT;
#endif /* LPI2C0_MCR_INIT */
#if defined(LPI2C0_SIER_INIT)
  LPI2C0->SIER = LPI2C0_SIER_INIT;
#endif /* LPI2C0_SIER_INIT */
#if defined(LPI2C0_SDER_INIT)
  LPI2C0->SDER = LPI2C0_SDER_INIT;
#endif /* LPI2C0_SDER_INIT */
#if defined(LPI2C0_SCFGR0_INIT)
  LPI2C0->SCFGR0 = LPI2C0_SCFGR0_INIT;
#endif /* LPI2C0_SCFGR0_INIT */
#if defined(LPI2C0_SCFGR1_INIT)
  LPI2C0->SCFGR1 = LPI2C0_SCFGR1_INIT;
#endif /* LPI2C0_SCFGR1_INIT */
#if defined(LPI2C0_SCFGR2_INIT)
  LPI2C0->SCFGR2 = LPI2C0_SCFGR2_INIT;
#endif /* LPI2C0_SCFGR2_INIT */
#if defined(LPI2C0_SCFGR3_INIT)
  LPI2C0->SCFGR3 = LPI2C0_SCFGR3_INIT;
#endif /* LPI2C0_SCFGR3_INIT */
#if defined(LPI2C0_SAMR0_INIT)
  LPI2C0->SAMR0 = LPI2C0_SAMR0_INIT;
#endif /* LPI2C0_SAMR0_INIT */
#if defined(LPI2C0_SAMR1_INIT)
  LPI2C0->SAMR1 = LPI2C0_SAMR1_INIT;
#endif /* LPI2C0_SAMR1_INIT */
#if defined(LPI2C0_SCR_INIT)
  LPI2C0->SCR = LPI2C0_SCR_INIT;
#endif /* LPI2C0_SCR_INIT */
}

/***********************************************************************************************************************
 * TIMER initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'TIMER'
- type: 'qtmr_reg'
- mode: 'general'
- custom_name_enabled: 'true'
- type_id: 'qtmr_reg_19ff29c7d66f72ec59fde9c83852e6f9'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'TMRA'
- config_sets:
  - generalConfig:
    - clockSource: 'BusInterfaceClock'
    - clockSourceFreq: 'ClocksTool_DefaultInit'
    - enable_timer_channels:
      - 0:
        - enableTimerChannel: 'true'
      - 1:
        - enableTimerChannel: 'false'
      - 2:
        - enableTimerChannel: 'false'
      - 3:
        - enableTimerChannel: 'false'
    - input_filters:
      - 0:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 1:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 2:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
      - 3:
        - inputFilterPeriod: '0'
        - inputFilterCount: '3'
    - qtmr_channels:
      - 0:
        - channel: '0'
        - channelConfig:
          - primarySource: '8'
          - secondarySource: '0'
          - inputPolarity: 'false'
          - inputFault: 'false'
          - countingMode: '1'
          - enableCountOnce: 'false'
          - countLength: '1'
          - inputAltLoad: 'false'
          - countDirection: '0'
          - triggeredCountInit: '0'
          - enableMasterMode: 'false'
          - enableExternalForce: 'false'
          - enableCoChannelReinit: 'false'
          - outputMode: '0'
          - forceOutputValue: 'false'
          - forcedOutputValue: '0'
          - outputPolarity: 'false'
          - outputEnabled: 'false'
          - captureMode: '0'
          - reloadOnCapture: 'false'
          - compare1Period: '20000'
          - compareLoadControl1: '1'
          - compare2Period: '0'
          - compareLoadControl2: '0'
          - compareLoad1: '20000'
          - compareLoad2: '0'
          - counterLoad: '0'
          - counterInit: '0'
          - debugMode: '0'
          - interruptSources:
            - kQTMR_CompareInterruptEnable: 'false'
            - kQTMR_Compare1InterruptEnable: 'true'
            - kQTMR_Compare2InterruptEnable: 'false'
            - kQTMR_OverflowInterruptEnable: 'false'
            - kQTMR_EdgeInterruptEnable: 'false'
          - enable_irq: 'true'
          - interrupt:
            - IRQn: 'kTMRA_0_VECTORn'
            - dsc_enable_interrrupt: 'iprVal1'
            - enable_custom_name: 'true'
            - handler_custom_name: 'TIMER_IRQ_HANDLER'
          - dma:
            - kQTMR_InputEdgeFlagDmaEnable: 'false'
            - kQTMR_ComparatorPreload1DmaEnable: 'false'
            - kQTMR_ComparatorPreload2DmaEnable: 'false'
        - template_params: []
    - qtmr_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void TIMER_init(void) {
/****************************************************************************/
/* Channel 0 initialization */
/****************************************************************************/
  /* Disable the channel before the module init*/
  TMRA->CHANNEL[0].ENBL &= ~(TMR_ENBL_ENBL(1U << 0));
  TMRA->CHANNEL[0].HOLD = 0x0U;
  TMRA->CHANNEL[0].CAPT = 0x0U;
#ifdef TIMER_COMP10_INIT
  TMRA->CHANNEL[0].COMP1 = TIMER_COMP10_INIT;
#else
  TMRA->CHANNEL[0].COMP1 = 0x0U;
#endif /*TIMER_COMP10_INIT*/
#ifdef TIMER_COMP20_INIT
  TMRA->CHANNEL[0].COMP2 = TIMER_COMP20_INIT;
#else
  TMRA->CHANNEL[0].COMP2 = 0x0U;
#endif /*TIMER_COMP20_INIT */
#ifdef TIMER_LOAD0_INIT
  TMRA->CHANNEL[0].LOAD = TIMER_LOAD0_INIT;
#else
  TMRA->CHANNEL[0].LOAD = 0x0U;
#endif /*TIMER_LOAD0_INIT */
#ifdef TIMER_CNTR0_INIT
  TMRA->CHANNEL[0].CNTR = TIMER_CNTR0_INIT;
#else
  TMRA->CHANNEL[0].CNTR = 0x0U;
#endif /*TIMER_CNTR0_INIT */
#ifdef TIMER_SCTRL0_INIT
  TMRA->CHANNEL[0].SCTRL = TIMER_SCTRL0_INIT;
#else
  TMRA->CHANNEL[0].SCTRL = 0x0U;
#endif /*TIMER_SCTRL0_INIT */
#ifdef TIMER_CMPLD10_INIT
  TMRA->CHANNEL[0].CMPLD1 = TIMER_CMPLD10_INIT;
#else
  TMRA->CHANNEL[0].CMPLD1 = 0x0U;
#endif /*TIMER_CMPLD10_INIT */
#ifdef TIMER_CMPLD20_INIT
  TMRA->CHANNEL[0].CMPLD2 = TIMER_CMPLD20_INIT;
#else
  TMRA->CHANNEL[0].CMPLD2 = 0x0U;
#endif /*TIMER_CMPLD20_INIT */
#ifdef TIMER_CSCTRL0_INIT
  TMRA->CHANNEL[0].CSCTRL = TIMER_CSCTRL0_INIT;
#else
  TMRA->CHANNEL[0].CSCTRL = 0x0U;
#endif /*TIMER_CSCTRL0_INIT */
#ifdef TIMER_DMA0_INIT
  TMRA->CHANNEL[0].DMA = TIMER_DMA0_INIT;
#else
  TMRA->CHANNEL[0].DMA = 0x0U;
#endif /*TIMER_DMA0_INIT */
#ifdef TIMER_CTRL0_INIT
  TMRA->CHANNEL[0].CTRL = TIMER_CTRL0_INIT;
#else
  TMRA->CHANNEL[0].CTRL = 0x0U;
#endif /*TIMER_CTRL0_INIT */
/****************************************************************************/
/* Quad timer global initialization */
/****************************************************************************/
  /* Input filters configuration */
#ifdef TIMER_FILT0_INIT
  TMRA->CHANNEL[0].FILT = TIMER_FILT0_INIT;
#else
  TMRA->CHANNEL[0].FILT = 0x0U;
#endif /*TIMER_FILT0_INIT */
#ifdef TIMER_FILT1_INIT
  TMRA->CHANNEL[1].FILT = TIMER_FILT1_INIT;
#else
  TMRA->CHANNEL[1].FILT = 0x0U;
#endif /*TIMER_FILT1_INIT */
#ifdef TIMER_FILT2_INIT
  TMRA->CHANNEL[2].FILT = TIMER_FILT2_INIT;
#else
  TMRA->CHANNEL[2].FILT = 0x0U;
#endif /*TIMER_FILT2_INIT */
#ifdef TIMER_FILT3_INIT
  TMRA->CHANNEL[3].FILT = TIMER_FILT3_INIT;
#else
  TMRA->CHANNEL[3].FILT = 0x0U;
#endif /*TIMER_FILT3_INIT */
  /* Synchronous start of all channels */
#if defined(TIMER_ENBL_INIT)
   TMRA->CHANNEL[0].ENBL = (TMRA->CHANNEL[0].ENBL & (~TIMER_ENBL_INIT_MASK)) | (TIMER_ENBL_INIT & TIMER_ENBL_INIT_MASK);
#endif /*TIMER_TMRA_ENBL_INIT */
}

/***********************************************************************************************************************
 * Initialization functions
 **********************************************************************************************************************/
static void BOARD_InitPeripherals_CommonPreInit(void)
{
  /* Disable all interrupts to prevent invoking of any interrupt during initialization of peripherals. */
  INTC->CTRL |= INTC_CTRL_INT_DIS_MASK;
  /* Enable clock gate of the LPI2C0 peripheral. */
  SIM->PCE1 |= SIM_PCE1_LPI2C0_MASK;
  /* Enable clock gate of the TMRA peripheral. */
  SIM->PCE0 |= SIM_PCE0_TA0_MASK;
}

static void BOARD_InitPeripherals_CommonPostInit(void)
{
  /* Set the interrupt priority: Priority 0 of the kTMRA_0_VECTORn request in the INTC. */
  INTC->IPR2 = (INTC->IPR2 & ~INTC_IPR2_TMRA_0_MASK) | INTC_IPR2_TMRA_0(1);
  /* Enable all interrupts after initialization of peripherals. */
  INTC->CTRL &= ~INTC_CTRL_INT_DIS_MASK;
  /* Initialization of masked/enabled DSC core interrupt levels. */
  __EI(3);
}

void BOARD_InitPeripherals(void)
{
  /* Common pre-initialization */
  BOARD_InitPeripherals_CommonPreInit();
  /* Initialize components */
  LPI2C0_init();
  TIMER_init();
  /* Common post-initialization */
  BOARD_InitPeripherals_CommonPostInit();
}

/***********************************************************************************************************************
 * BOARD_InitBootPeripherals function
 **********************************************************************************************************************/
void BOARD_InitBootPeripherals(void)
{
  BOARD_InitPeripherals();
}
